src/DataProcessors/ФормированиеОтчетовПоставщикамVMI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеОтчетовПоставщикамVMI</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДок</Name>
					<Comment>Дата, на которую будут сформированы документы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРегламент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтправлятьПоставщику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрайсыПоставщиков</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрайсПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНач</Name>
							<Comment>Дата начала выборки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКон</Name>
							<Comment>Дата окончания выборки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разделять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормироватьДокументы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецМесяцаОтдельно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнегоОтчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Информация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДелитьОтчетVMI</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПродажи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрайсПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПрихода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыСтрокПриходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изготовитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Изготовители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/РасписанияОтчетовПоставщикамVMI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РасписанияОтчетовПоставщикамVMI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Частота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Разделять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонецМесяцаОтдельно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧетНечет</Name>
					<Comment>1 - каждый, 2 - четный, 3 - нечетный</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УИД77</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПериодаПоследнегоОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Задержка</Name>
					<Comment>Задержка при отправке отчета на конец месяца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СкидкаПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрайсПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрайсыПоставщиковVMI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ФормированиеОтчетовПоставщикамVMI/Ext/ManagerModule.bsl
Функция ПолучитьСписокПрайсовПоставщиковНаДатуОтчета(вхДата, вхПоставщик = Неопределено, ЛогОшибок) Экспорт
	лТабПрайсов = Новый ТаблицаЗначений;
	лТабПрайсов.Колонки.Добавить("Поставщик");
	лТабПрайсов.Колонки.Добавить("Организация");
	лТабПрайсов.Колонки.Добавить("Договор");
	лТабПрайсов.Колонки.Добавить("Склад");
	лТабПрайсов.Колонки.Добавить("ПрайсПоставщика");
	лТабПрайсов.Колонки.Добавить("ДатаНач");
	лТабПрайсов.Колонки.Добавить("ДатаКон");
	лТабПрайсов.Колонки.Добавить("Разделять");
	лТабПрайсов.Колонки.Добавить("КонецМесяцаОтдельно");
	лТабПрайсов.Колонки.Добавить("СкидкаСумма");
	лТабПрайсов.Колонки.Добавить("СкидкаПроцент");
	лТабПрайсов.Колонки.Добавить("ДатаПоследнегоОтчета");
	лТабПрайсов.Колонки.Добавить("Информация");
	лТабПрайсов.Колонки.Добавить("ДелитьОтчетVMI");

	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Р.ПрайсПоставщика,
	|	Р.Периодичность
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.День)
	|	{УсловиеКонтрагент}
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Р.ПрайсПоставщика,
	|	Р.Периодичность
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|	{УсловиеКонтрагент}
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Р.ПрайсПоставщика,
	|	Р.Периодичность
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|	{УсловиеКонтрагент}"
	);
	
	Если ЗначениеЗаполнено(вхПоставщик) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", " И Р.ПрайсПоставщика.Владелец = &Поставщик ");
		Запрос.УстановитьПараметр("Поставщик", вхПоставщик);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", "");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛогОшибок = ЛогОшибок + ?(ПустаяСтрока(ЛогОшибок), "", Символы.ПС) 
		+ "не сформирован отчет по прайсу " + Строка(Выборка.ПрайсПоставщика) 
		+ " - не описан программный код для периодичности '" + Строка(Выборка.Периодичность) + "'";
		
	КонецЦикла;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р.ПрайсПоставщика
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|	И Р.Частота > 2
	|	{УсловиеКонтрагент}";
	
	Если ЗначениеЗаполнено(вхПоставщик) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", " И Р.ПрайсПоставщика.Владелец = &Поставщик ");
		Запрос.УстановитьПараметр("Поставщик", вхПоставщик);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", "");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛогОшибок = ЛогОшибок + ?(ПустаяСтрока(ЛогОшибок), "", Символы.ПС)
		+ "не сформирован отчет по прайсу " + Строка(Выборка.ПрайсПоставщика) 
		+ " - не описан программный код для периодичности Неделя с частотой больше, чем раз в две недели";
		
	КонецЦикла;
	
	//основной отбор по дню недели 
	//Запрос.УстановитьПараметр("ЭтотДеньНедели", ДеньНедели(вхДата)); //через функцию в запросе
	Запрос.УстановитьПараметр("ДатаОтчета", вхДата);
	
	//предполагается, что отчет делается за прошлую неделю, для недельных расписаний
	ДатаКонКаждаяНеделя = НачалоНедели(вхДата) - 1;
	ДатаНачКаждаяНеделя = НачалоНедели(ДатаКонКаждаяНеделя);
	
	//предполагается, что отчет делается за прошлых две недели, для расписаний по четным, нечетным неделям
	ДатаКонНеделяЧетНечет = НачалоНедели(вхДата) - 1;
	ДатаНачНеделяЧетНечет = НачалоНедели(ДатаКонНеделяЧетНечет - 604800);//7*24*60*60 сек
	
	Запрос.УстановитьПараметр("ДатаНачКаждаяНеделя", ДатаНачКаждаяНеделя);
	Запрос.УстановитьПараметр("ДатаКонКаждаяНеделя", ДатаКонКаждаяНеделя);
	Запрос.УстановитьПараметр("ДатаНачНеделяЧетНечет", ДатаНачНеделяЧетНечет);
	Запрос.УстановитьПараметр("ДатаКонНеделяЧетНечет", ДатаКонНеделяЧетНечет);
	
	//определим четная это неделя или нет
	//для каждой недели ЧетНечет = 1
	ЧетнаяНеделя = ?(НеделяГода(вхДата)/2 - Цел(НеделяГода(вхДата)/2) = 0, Истина, Ложь);
	
	Если ЧетнаяНеделя Тогда
		Запрос.УстановитьПараметр("ЧетНечет", 2);
	Иначе
		Запрос.УстановитьПараметр("ЧетНечет", 3);
	КонецЕсли;
	
	//установим параметры для получения расписания месячных отчетов
	ДатаКонцаМесяца = НачалоМесяца(вхДата) - 1;
	ДатаНачалаМесяца = НачалоМесяца(ДатаКонцаМесяца);
	Запрос.УстановитьПараметр("ДатаНачалаМесяца", ДатаНачалаМесяца);
	Запрос.УстановитьПараметр("ДатаКонцаМесяца", ДатаКонцаМесяца);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р.ПрайсПоставщика.Владелец КАК Поставщик,
	|	Р.Организация КАК Организация,
	|	Д.Ссылка КАК Договор,
	|	Р.Склад КАК Склад,
	|	Р.ПрайсПоставщика КАК ПрайсПоставщика,
	|	&ДатаНачКаждаяНеделя КАК ДатаНач,
	|	&ДатаКонКаждаяНеделя КАК ДатаКон,
	|	Р.Разделять,
	|	Р.КонецМесяцаОтдельно,
	|	Р.СкидкаСумма,
	//# Kalinin V.A. ( 2018-06-25 )
	|	Р.ДелитьОтчетVMI,
	//
	|	Р.Информация,
	|	Р.ДатаОкончанияПериодаПоследнегоОтчета КАК ДатаПоследнегоОтчета,
	|	ВЫБОР 
	|		КОГДА Р.СкидкаПроцент > 0 ТОГДА Р.СкидкаПроцент
	|		ИНАЧЕ Р.ПрайсПоставщика.Владелец.ПроцентОтклоненияЦенПрихода
	|	КОНЕЦ КАК СкидкаПроцент
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Д
	|		ПО Р.ПрайсПоставщика.Владелец = Д.Владелец
	|			И Р.Организация = Д.Организация
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|	И Р.Частота = 1
	|	И Р.ЧетНечет = 1
	|	И Р.НачальнаяДата <= &ДатаОтчета
	|	И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонКаждаяНеделя
	|	И Р.ДеньНедели = ДЕНЬНЕДЕЛИ(&ДатаОтчета)
	|	И Д.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)
	|	И НЕ Д.ПометкаУдаления
	|	{УсловиеКонтрагент}
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Р.ПрайсПоставщика.Владелец,
	|	Р.Организация,
	|	Д.Ссылка,
	|	Р.Склад,
	|	Р.ПрайсПоставщика,
	|	&ДатаНачНеделяЧетНечет,
	|	&ДатаКонНеделяЧетНечет,
	|	Р.Разделять,
	|	Р.КонецМесяцаОтдельно,
	|	Р.СкидкаСумма,
	//# Kalinin V.A. ( 2018-06-25 )
	|	Р.ДелитьОтчетVMI,
	//
	|	Р.Информация,
	|	Р.ДатаОкончанияПериодаПоследнегоОтчета,
	|	ВЫБОР 
	|		КОГДА Р.СкидкаПроцент > 0 ТОГДА Р.СкидкаПроцент
	|		ИНАчЕ Р.ПрайсПоставщика.Владелец.ПроцентОтклоненияЦенПрихода
	|	КОНЕЦ КАК СкидкаПроцент
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Д
	|		ПО Р.ПрайсПоставщика.Владелец = Д.Владелец
	|			И Р.Организация = Д.Организация
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|	И Р.Частота = 2
	|	И Р.ЧетНечет = &ЧетНечет
	|	И Р.НачальнаяДата <= &ДатаОтчета
	|	И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонНеделяЧетНечет
	|	И Р.ДеньНедели = ДЕНЬНЕДЕЛИ(&ДатаОтчета)
	|	И Д.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)
	|	И НЕ Д.ПометкаУдаления
	|	{УсловиеКонтрагент}
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Р.ПрайсПоставщика.Владелец,
	|	Р.Организация,
	|	Д.Ссылка,
	|	Р.Склад,
	|	Р.ПрайсПоставщика,
	|	&ДатаНачалаМесяца,
	|	&ДатаКонцаМесяца,
	|	Р.Разделять,
	|	Р.КонецМесяцаОтдельно,
	|	Р.СкидкаСумма,
	//# Kalinin V.A. ( 2018-06-25 )
	|	Р.ДелитьОтчетVMI,
	//
	|	Р.Информация,
	|	Р.ДатаОкончанияПериодаПоследнегоОтчета,
	|	ВЫБОР 
	|		КОГДА Р.СкидкаПроцент > 0 ТОГДА Р.СкидкаПроцент
	|		ИНАчЕ Р.ПрайсПоставщика.Владелец.ПроцентОтклоненияЦенПрихода
	|	КОНЕЦ КАК СкидкаПроцент
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Д
	|		ПО Р.ПрайсПоставщика.Владелец = Д.Владелец
	|			И Р.Организация = Д.Организация
	|ГДЕ
	|	Р.Используется
	|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|	И Р.Частота = 1
	|	И Р.НачальнаяДата <= &ДатаОтчета
	|	И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонцаМесяца
	|	И Р.ЧислоМесяца = ДЕНЬ(&ДатаОтчета)
	|	И Д.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)
	|	И НЕ Д.ПометкаУдаления
	|	{УсловиеКонтрагент}
	|
	|{ВставитьНастройкиЧислоМесяцаРавноНоль}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поставщик,
	|	ПрайсПоставщика,
	|	Склад";
		
	//в базе есть куча настроек для месяца, где число месяца не указано
	//для них будем делать отчет каждого третьего числа
	Если День(вхДата) = 3 Тогда
		ПодзапросЗамены = "
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Р.ПрайсПоставщика.Владелец,
		|	Р.Организация,
		|	Д.Ссылка,
		|	Р.Склад,
		|	Р.ПрайсПоставщика,
		|	&ДатаНачалаМесяца,
		|	&ДатаКонцаМесяца,
		|	Р.Разделять,
		|	Р.КонецМесяцаОтдельно,
		//# Kalinin V.A. ( 2018-06-25 )
		|	Р.ДелитьОтчетVMI,
		//
		|	Р.Информация,
		|	Р.СкидкаСумма,
		|	Р.ДатаОкончанияПериодаПоследнегоОтчета,
		|	ВЫБОР 
		|		КОГДА Р.СкидкаПроцент > 0 ТОГДА Р.СкидкаПроцент
		|		ИНАЧЕ Р.ПрайсПоставщика.Владелец.ПроцентОтклоненияЦенПрихода
		|	КОНЕЦ КАК СкидкаПроцент
		|ИЗ
		|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК Р
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Д
		|		ПО Р.ПрайсПоставщика.Владелец = Д.Владелец
		|			И Р.Организация = Д.Организация
		|ГДЕ
		|	Р.Используется
		|	И Р.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
		|	И Р.Частота = 1 
		|	И Р.НачальнаяДата <= &ДатаОтчета
		|	И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонцаМесяца
		|	И Р.ЧислоМесяца = 0
		|	И Д.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)
		|	И НЕ Д.ПометкаУдаления
		|	{УсловиеКонтрагент}";
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВставитьНастройкиЧислоМесяцаРавноНоль}", ПодзапросЗамены);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВставитьНастройкиЧислоМесяцаРавноНоль}", "");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(вхПоставщик) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", " И Р.ПрайсПоставщика.Владелец = &Поставщик ");
		//чтобы делалось по всем прайсам поставщикам, несмотря на настройки
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Р.ДеньНедели = ДЕНЬНЕДЕЛИ(&ДатаОтчета)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Р.ЧислоМесяца = ДЕНЬ(&ДатаОтчета)", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Р.ЧетНечет = &ЧетНечет","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонКаждаяНеделя","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Р.ДатаОкончанияПериодаПоследнегоОтчета < &ДатаКонНеделяЧетНечет","");
		//--
		Запрос.УстановитьПараметр("Поставщик", вхПоставщик);
		
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{УсловиеКонтрагент}", "");
		
	КонецЕсли;
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ЛогОшибок = ЛогОшибок + "не нашлось прайсов для формирования отчета на " + Формат(вхДата, "ДЛФ=DD");
	Иначе
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Результат.Выгрузить(), лТабПрайсов);
	КонецЕсли;
	
	Возврат лТабПрайсов;
	
КонецФункции

Функция ПолучитьСписокПрайсовПоставщиковНаДатуОтчета_бу(вхДата) Экспорт
	ТабПрайсов = Новый ТаблицаЗначений;
	ТабПрайсов.Колонки.Добавить("Поставщик");
	ТабПрайсов.Колонки.Добавить("Договор");
	ТабПрайсов.Колонки.Добавить("ПрайсПоставщика");
	ТабПрайсов.Колонки.Добавить("ДатаНач");//начальная дата периода отчета
	ТабПрайсов.Колонки.Добавить("ДатаКон");
	ТабПрайсов.Колонки.Добавить("Разделять");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сегодня", вхДата);
	Запрос.УстановитьПараметр("ОтветХранение", Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение);
	
	//день
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец КАК Поставщик,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РасписанияОтчетовПоставщикамVMI.Склад,
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Сегодня, ДЕНЬ, -РасписанияОтчетовПоставщикамVMI.Частота), ДЕНЬ) КАК ДатаНач,
	|	КОНЕЦПЕРИОДА(&Сегодня, ДЕНЬ) КАК ДатаКон,
	|	РасписанияОтчетовПоставщикамVMI.Разделять,
	|	РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК РазницаДат,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК ЧИСЛО(15, 0)) КАК РазницаДатЦелое
	|ПОМЕСТИТЬ втРасписание
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК РасписанияОтчетовПоставщикамVMI
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец = ДоговорыКонтрагентов.Владелец
	|			И РасписанияОтчетовПоставщикамVMI.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	РасписанияОтчетовПоставщикамVMI.Периодичность = &Периодичность
	|	И РасписанияОтчетовПоставщикамVMI.НачальнаяДата <= &Сегодня
	|	И ДоговорыКонтрагентов.ВидДоговора = &ОтветХранение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасписание.Поставщик,
	|	втРасписание.Договор,
	|	втРасписание.ПрайсПоставщика,
	|	втРасписание.ДатаНач,
	|	втРасписание.ДатаКон,
	|	втРасписание.Разделять
	|ИЗ
	|	втРасписание КАК втРасписание
	|ГДЕ
	|	втРасписание.РазницаДат - втРасписание.РазницаДатЦелое = 0";
	
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.День);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТабПрайсов);
	
	//неделя
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец КАК Поставщик,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РасписанияОтчетовПоставщикамVMI.Склад,
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Сегодня, НЕДЕЛЯ, -РасписанияОтчетовПоставщикамVMI.Частота), НЕДЕЛЯ) КАК ДатаНач,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Сегодня, НЕДЕЛЯ, -1), НЕДЕЛЯ) КАК ДатаКон,
	|	РасписанияОтчетовПоставщикамVMI.Разделять,
	|	РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК РазницаДат,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК ЧИСЛО(15, 0)) КАК РазницаДатЦелое
	|ПОМЕСТИТЬ втРасписание
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК РасписанияОтчетовПоставщикамVMI
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец = ДоговорыКонтрагентов.Владелец
	|			И РасписанияОтчетовПоставщикамVMI.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	РасписанияОтчетовПоставщикамVMI.Периодичность = &Периодичность
	|	И РасписанияОтчетовПоставщикамVMI.НачальнаяДата <= &Сегодня
	|	И ДоговорыКонтрагентов.ВидДоговора = &ОтветХранение
	|	И ДЕНЬНЕДЕЛИ(РасписанияОтчетовПоставщикамVMI.НачальнаяДата) = ДЕНЬНЕДЕЛИ(&Сегодня)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасписание.Поставщик,
	|	втРасписание.Договор,
	|	втРасписание.ПрайсПоставщика,
	|	втРасписание.ДатаНач,
	|	втРасписание.ДатаКон,
	|	втРасписание.Разделять
	|ИЗ
	|	втРасписание КАК втРасписание
	|ГДЕ
	|	втРасписание.РазницаДат - втРасписание.РазницаДатЦелое = 0";
	
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Неделя);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТабПрайсов);
	
	//месяц
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец КАК Поставщик,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	РасписанияОтчетовПоставщикамVMI.Склад,
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Сегодня, МЕСЯЦ, -РасписанияОтчетовПоставщикамVMI.Частота), МЕСЯЦ) КАК ДатаНач,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Сегодня, МЕСЯЦ, -1), МЕСЯЦ) КАК ДатаКон,
	|	РасписанияОтчетовПоставщикамVMI.Разделять,
	|	РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК РазницаДат,
	|	ВЫРАЗИТЬ(РАЗНОСТЬДАТ(&Сегодня, РасписанияОтчетовПоставщикамVMI.НачальнаяДата, ДЕНЬ) / РасписанияОтчетовПоставщикамVMI.Частота КАК ЧИСЛО(15, 0)) КАК РазницаДатЦелое
	|ПОМЕСТИТЬ втРасписание
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК РасписанияОтчетовПоставщикамVMI
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика.Владелец = ДоговорыКонтрагентов.Владелец
	|			И РасписанияОтчетовПоставщикамVMI.Организация = ДоговорыКонтрагентов.Организация
	|ГДЕ
	|	РасписанияОтчетовПоставщикамVMI.Периодичность = &Периодичность
	|	И РасписанияОтчетовПоставщикамVMI.НачальнаяДата <= &Сегодня
	|	И ДоговорыКонтрагентов.ВидДоговора = &ОтветХранение
	|	И ДЕНЬ(РасписанияОтчетовПоставщикамVMI.НачальнаяДата) = ДЕНЬ(&Сегодня)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРасписание.Поставщик,
	|	втРасписание.Договор,
	|	втРасписание.ПрайсПоставщика,
	|	втРасписание.ДатаНач,
	|	втРасписание.ДатаКон,
	|	втРасписание.Разделять
	|ИЗ
	|	втРасписание КАК втРасписание
	|ГДЕ
	|	втРасписание.РазницаДат - втРасписание.РазницаДатЦелое = 0";
	
	
	Запрос.УстановитьПараметр("Периодичность", Перечисления.Периодичность.Месяц);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТабПрайсов);
	
	Возврат ТабПрайсов;
	
КонецФункции

Функция ЗаполнитьОстаткамиПоРегиструПартий_СдатойПродажи(ПрайсПоставщика, Договор, Склад, ДатаНач = Неопределено, ДатаКон, ЛогОшибок, СкидкаСумма = 0, СкидкаПроцент = 0) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СтрокаПрихода
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.Остатки(
	|			&ДатаКон,
	|			ДоговорКонтрагента.Владелец = &Поставщик
	|				И ДоговорКонтрагента = &Договор
	|				И Склад = &Склад) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Р.Период КАК ДатаПродажи,
	|	&ПрайсПоставщика,
	|	Р.ДоговорКонтрагента КАК Договор,
	|	Р.Склад,
	|	Р.СтрокаПрихода КАК СтрокаПрихода,
	|	Р.Номенклатура.Артикул КАК Артикул,
	|	Р.Номенклатура.Изготовитель КАК Изготовитель,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	Р.КоличествоПриход КАК Количество,
	|	Р.СуммаРублиПриход КАК Сумма,
	|	Р.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА Р.СтрокаПрихода.Приход ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.СтрокаПрихода.Приход КАК Документ.ПоступлениеТоваровУслуг).Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаПоступления,	
	|	&СкидкаСумма КАК СкидкаСумма,
	|	&СкидкаПроцент КАК СкидкаПроцент
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.ОстаткиИОбороты(
	|			{ДатаНач},
	|			&ДатаКон,
	|			Регистратор,
	|			,
	|			СтрокаПрихода В
	|				(ВЫБРАТЬ
	|					Остатки.СтрокаПрихода
	|				ИЗ
	|					Остатки КАК Остатки) И Склад = &Склад) КАК Р
	|ГДЕ
	|	Р.КоличествоПриход > 0";
	
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДатаНач}", "&ДатаНач" );
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДатаНач}", "" );
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Поставщик", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПрайсПоставщика, "Владелец"));
	Запрос.УстановитьПараметр("ПрайсПоставщика", ПрайсПоставщика);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СкидкаСумма", СкидкаСумма);
	Запрос.УстановитьПараметр("СкидкаПроцент", СкидкаПроцент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		ЛогОшибок = ЛогОшибок + ?(ПустаяСтрока(ЛогОшибок), "", Символы.ПС)
		+ "нет остатков в регистре Партий, отчеты МХ-3 по прайсу: " + Строка(ПрайсПоставщика) + " по складу: " + Склад + " не будут сформированы";
		
	КонецЕсли;
	
	//пересчет НДС в модуле объекта
	//Для Каждого Товар Из Результат Цикл
	//	Товар.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Товар.Сумма, Истина, Истина, Товар.СтавкаНДС);
	//	
	//КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьОстаткамиПоРегиструПартий_кривая(ПрайсПоставщика, Договор, Склад, ДатаНач = Неопределено, ДатаКон, ЛогОшибок, СкидкаСумма = 0, СкидкаПроцент = 0) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Остатки.СтрокаПрихода
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.Остатки(
	|			&ДатаКон,
	|			ДоговорКонтрагента.Владелец = &Поставщик
	|				И ДоговорКонтрагента = &Договор
	|				И Склад = &Склад) КАК Остатки
	|ГДЕ
	|	Остатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Р.Период КАК ДатаПродажи,
	|	&ПрайсПоставщика,
	|	Р.ДоговорКонтрагента КАК Договор,
	|	Р.Склад,
	|	Р.СтрокаПрихода КАК СтрокаПрихода,
	|	Р.Номенклатура.Артикул КАК Артикул,
	|	Р.Номенклатура.Изготовитель КАК Изготовитель,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	Р.КоличествоПриход - Р.КоличествоРасход КАК Количество,
	|	Р.СуммаРублиПриход - Р.СуммаРублиРасход КАК Сумма,
	|	Р.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА Р.СтрокаПрихода.Приход ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ТОГДА ВЫРАЗИТЬ(Р.СтрокаПрихода.Приход КАК Документ.ПоступлениеТоваровУслуг).Дата
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	КОНЕЦ КАК ДатаПоступления,	
	|	&СкидкаСумма КАК СкидкаСумма,
	|	&СкидкаПроцент КАК СкидкаПроцент
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.ОстаткиИОбороты(
	//|			{ДатаНач}
	|,
	|			&ДатаКон,
	|			Регистратор,
	|			,
	|			СтрокаПрихода В
	|				(ВЫБРАТЬ
	|					Остатки.СтрокаПрихода
	|				ИЗ
	|					Остатки КАК Остатки)) КАК Р
	|ГДЕ
	|	Р.КоличествоПриход - Р.КоличествоРасход > 0";
	
	Если ЗначениеЗаполнено(ДатаНач) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДатаНач}", "&ДатаНач" );
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаНач));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДатаНач}", "" );
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Поставщик", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПрайсПоставщика, "Владелец"));
	Запрос.УстановитьПараметр("ПрайсПоставщика", ПрайсПоставщика);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СкидкаСумма", СкидкаСумма);
	Запрос.УстановитьПараметр("СкидкаПроцент", СкидкаПроцент);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		ЛогОшибок = ЛогОшибок + ?(ПустаяСтрока(ЛогОшибок), "", Символы.ПС)
		+ "нет остатков в регистре Партий, отчеты МХ-3 по прайсу: " + Строка(ПрайсПоставщика) + " по складу: " + Склад + " не будут сформированы";
		
	КонецЕсли;
	
	//пересчет НДС в модуле объекта
	//Для Каждого Товар Из Результат Цикл
	//	Товар.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(Товар.Сумма, Истина, Истина, Товар.СтавкаНДС);
	//	
	//КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЗаполнитьОстаткамиПоРегиструПартий(ПрайсПоставщика, ДатаКон, Договор, Склад) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р.Период КАК ДатаПродажи,
	|	&ПрайсПоставщика,
	|	Р.Склад,
	|	Р.СтрокаПрихода КАК СтрокаПрихода,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	СУММА(Р.КоличествоПриход) КАК Количество,
	|	СУММА(Р.СуммаРублиПриход) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.ОстаткиИОбороты(
	|			,
	|			&ДатаКон,
	|			Регистратор,
	|			,
	|			ДоговорКонтрагента.Владелец = &Поставщик
	|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)
	|				И ДоговорКонтрагента = &Договор
	|				И Склад = &Склад) КАК Р
	|ГДЕ
	|	Р.КоличествоКонечныйОстаток > 0
	|	И Р.КоличествоПриход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Р.Период,
	|	Р.Склад,
	|	Р.СтрокаПрихода,
	|	Р.Номенклатура,
	|	Р.Номенклатура.СтавкаНДС,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент";
	
//	|				И СостояниеПартии = &СостояниеПартии) КАК ПартииТоваровVMIОстатки";
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Поставщик", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПрайсПоставщика, "Владелец"));
	Запрос.УстановитьПараметр("ПрайсПоставщика", ПрайсПоставщика);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Склад", Склад);
	//Запрос.УстановитьПараметр("СостояниеПартии", Перечисления.СостоянияПартииТовараVMI.Реализован);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЗаполнитьОстаткамиПоРегиструПартий_бу(ПрайсПоставщика, ДатаКон) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р.Период КАК ДатаПродажи,
	|	&ПрайсПоставщика,
	|	Р.Склад,
	|	Р.СтрокаПрихода КАК СтрокаПрихода,
	|	Р.Номенклатура КАК Номенклатура,
	|	Р.Номенклатура.СтавкаНДС КАК СтавкаНДС,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент,
	|	СУММА(Р.КоличествоПриход) КАК Количество,
	|	СУММА(Р.СуммаРублиПриход) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ПартииТоваровVMI.ОстаткиИОбороты(
	|			,
	|			&ДатаКон,
	|			Регистратор,
	|			,
	|			ДоговорКонтрагента.Владелец = &Поставщик
	|				И ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ОтветХранение)) КАК Р
	|ГДЕ
	|	Р.КоличествоКонечныйОстаток > 0
	|	И Р.КоличествоПриход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Р.Период,
	|	Р.Склад,
	|	Р.СтрокаПрихода,
	|	Р.Номенклатура,
	|	Р.Номенклатура.СтавкаНДС,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков,
	|	Р.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент";
	
//	|				И СостояниеПартии = &СостояниеПартии) КАК ПартииТоваровVMIОстатки";
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Поставщик", ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПрайсПоставщика, "Владелец"));
	Запрос.УстановитьПараметр("ПрайсПоставщика", ПрайсПоставщика);
	//Запрос.УстановитьПараметр("СостояниеПартии", Перечисления.СостоянияПартииТовараVMI.Реализован);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
